Repository: yeroshenko-m/ToDoApp
Catalog: ToDoApp/Resourses/*.lproj/Localizable.strings
Languages: ru

# edit.project.screen_title.add
source: Add new project
ru: Создать проект

# edit.project.screen_title.edit
source: Edit project
ru: Изменить проект

# edit.project.screen_name.section.header
source: Project name
ru: Имя проекта

# edit.project.screen_name.section.footer
source: Use symbols a-z, A-Z, 0-9, or special characters (?!":;%$#@).
ru: Используйте символы a-z, A-Z, 0-9, или специальные символы (?!":;%$#@).

# edit.project.screen_color.section.header
source: Project color
ru: Цветовой маркер

# edit.project.screen_color.section.footer
source: Select one of given colors to mark new project with a color label.
ru: Выберите один цвет из списка для ярлыка проекта.

# edit.project.screen_parent.section.header
source: Parent project
ru: Родительский проект

# edit.project.screen_parent.section.footer
source: If your new project is a subproject of existing one, select its parent to keep the hierarchy.
ru: Если ваш проект является дочерним по отношению к уже существующему, укажите выберите его из списка.

# edit.project.screen_favorite.section.header
source: Is favorite
ru: Избранный проект

# edit.project.screen_favorite.section.footer
source: If you mark your project as favorite, it will be placed on top of your projects list.
ru: Если проект пометить как избранный, он будет отображен в верхней части списка Ваших проектов.

# edit.project.screen_delete.section.header
source: Delete project
ru: Удалить проект

# edit.project.screen_delete.section.footer
source: Attention! Project will be deleted completely. Restoring is impossible.
ru: Внимание! Данное действие будет невозможно отменить, проект будет полностью удален.

# edit.project.screen_textfield.cell.placeholder
source: New project name
ru: Введите имя проекта

# edit.project.screen_color.cell.empty
source: Choose color
ru: Выберите цвет

# edit.project.screen_parent.cell.empty
source: Choose parent
ru: Выберите проект

# edit.project.screen_favorite.cell.name
source: Is favorite
ru: Избранный проект

# edit.project.screen_alert.empty.name
source: Name can't be empty
ru: Имя не может быть пустым

# edit.project.screen_alert.project.created
source: New project created
ru: Новый проект создан

# edit.project.screen_alert.project.edited
source: Project edited
ru: Проект изменен

# edit.project.screen_alert.project.action.error
source: Error occured. Try later.
ru: Произошла ошибка. Повторите попытку позже.

# authorization.screen_title
source: Authorization
ru: Авторизация

# authorization.screen_alert.errorMessage
source: Error
ru: Ошибка

# authorization.screen_alert.reload.button
source: Reload page
ru: Перезагрузить страницу

# projects.list.screen_title
source: All projects
ru: Все проекты

# projects.list.screen_alert.deleteproject.title
source: Do you really want to delete project?
ru: Вы действительно хотите удалить проект?

# projects.list.screen_alert.confirm.deletion.button
source: Delete
ru: Удалить

# projects.list.screen_alert.cancel.deletion.button
source: Cancel
ru: Отмена

# projects.list.screen_alert.deleted
source: Deleted
ru: Удален

# projects.list.screen_alert.addproject.button
source: Add new project
ru: Добавить новый проект

# projects.list.screen_alert.canceladding.button
source: Cancel
ru: Отмена

# edit.task.screen_title.add
source: Add new task
ru: Создать задачу

# edit.task.screen_title.edit
source: Edit task
ru: Изменить задачу

# edit.task.screen_name.section.header
source: Task name
ru: Название задачи

# edit.task.screen_name.section.footer
source: Use symbols a-z, A-Z, 0-9, or special characters (?!":;%$#@).
ru: Используйте символы a-z, A-Z, 0-9, или специальные символы (?!":;%$#@).

# edit.task.screen_label.section.header
source: Task label
ru: Тег задачи

# edit.task.screen_label.section.footer
source: Select one of given labels to mark new task.
ru: Выберите один из представленных тегов или создайте свой.

# edit.task.screen_date.section.header
source: Due date
ru: Дедлайн задачи

# edit.task.screen_date.section.footer
source: If your task has deadline - select appropriate date and time, it will be displayed on task's cell. By default task doesn't have due date.
ru: Если задача имеет определенное время для ее выполнения - выберите дату и время, которые будут отображены на ячейке задачи.

# edit.task.screen_project.section.header
source: Related project
ru: Родительский проект

# edit.task.screen_project.section.footer
source: If the task is a part of existing project, select it to keep the hierarchy. By default all new tasks without related project are moved to Inbox project.
ru: Если ваша задача является частью уже существующего проекта, укажите его как родителя для задачи.

# edit.task.screen_priority.section.header
source: Task priority
ru: Приоритет задачи

# edit.task.screen_priority.section.footer
source: You can assign select task priority. By default it is 'Priority 4 - Low'.
ru: Вы можете назначить приоритет для задачи. По умолчанию все задачи имеют низкий приоритет.

# edit.task.screen_delete.section.header
source: Delete task
ru: Удалить задачу

# edit.task.screen_delete.section.footer
source: Attention! task will be deleted completely. Restoring is impossible.
ru: Внимание! Данное действие будет невозможно отменить, задача будет полностью удалена.

# edit.task.screen_textfield.cell.placeholder
source: New task name
ru: Моя новая задача

# edit.task.screen_project.cell.title
source: Select project
ru: Выберите проект

# edit.task.screen_label.cell.title
source: Select labels
ru: Выберите теги

# edit.task.screen_date.cell.title
source: Select date and time
ru: Выберите дату и время

# edit.task.screen_delete.cell.title
source: Delete
ru: Удалить

# edit.task.screen_alert.empty.name
source: Name can't be empty
ru: Имя не может быть пустым

# edit.task.screen_alert.task.created
source: New task created
ru: Задача создана

# edit.task.screen_alert.task.edited
source: Task edited
ru: Задача изменена

# edit.task.screen_alert.task.deleted
source: Task deleted
ru: Задача удалена

# edit.task.screen_alert.task.action.error
source: Error occured. Try later.
ru: Произошла ошибка. Повторите попытку позже.

# edit.task.screen_delete.confirmation.title
source: Do you really want to delete task?
ru: Вы действительно хотите удалить задачу?

# add.edit.controllers_reset.barbutton.title
source: Reset
ru: Сбросить

# tab.bar.controller_projects.list.title
source: Projects
ru: Проекты

# tab.bar.controller_tasks.list.title
source: Tasks
ru: Задачи

# tab.bar.controller_settings.title
source: Settings
ru: Настройки

# table.view_contextualaction.delete
source: Delete
ru: Удалить

# table.view_contextualaction.edit
source: Edit
ru: Изменить

# table.view_contextualaction.close
source: Close
ru: Закрыть

# table.view_contextualaction.make.not.favorite
source: Make not favorite
ru: Сделать не избранным

# table.view_contextualaction.make.favorite
source: Make favorite
ru: Сделать избранным

# datepicker.controller_estimating.alert.title
source: You can not estimate your task for date untill current
ru: Вы не можете запланировать выполнение задачи в прошлом.

# settings.controller_title
source: Settings
ru: Настройки

# settings.controller_alert.logout.title
source: Do you really want to log out?
ru: Вы действительно хотите выйти из аккаунта?

# settings.controller_alert.logout.confirm.action.title
source: Log out
ru: Выйти

# settings.controller_сell.logout.title
source: Logout
ru: Выйти

# settings.controller_logout.section.header
source: Log out from current account
ru: Выйти из текущего аккаунта

# settings.controller_logout.section.footer
source: After logout your login and password will be deleted from device.
ru: После выхода из аккаунта данные ваш логин и пароль будут удалены из устройства.

# all.tasks.controller_title
source: All tasks
ru: Все задачи

# priority_low
source: Default
ru: По умолчaнию

# priority_normal
source: Low
ru: Низкий

# priority_high
source: Medium
ru: Средний

# priority_urgent
source: High
ru: Высокий

# project.filters.screen_name.section
source: Name ordering options
ru: Порядок сортировки по имени

# project.filters.screen_favorite.section
source: Sort projects by 'favorite'
ru: Порядок сортировки проектов

# project.descriptor_name.az
source: Show by name A-Z
ru: По алфавиту A-Z

# project.descriptor_name.za
source: Show by name Z-A
ru: По алфавиту Z-A

# project.descriptor_favorite.first
source: Show favorite first
ru: Избранные сначала

# project.descriptor_favorite.last
source: Show non-favorite first
ru: Обычные сначала

# tasks.filters.screen_date.section
source: By planned date
ru: По дате планировнаия

# tasks.filters.screen_creation.section
source: By creation date
ru: По дате создания

# tasks.filters.screen_priority.section
source: By priority
ru: По приоритету

# task.descriptor_name.az
source: Show by name A-Z
ru: По алфавиту A-Z

# task.descriptor_name.za
source: Show by name Z-A
ru: По алфавиту Z-A

# task.descriptor_date.ascending
source: By date ascending
ru: По возрастанию даты выполнения

# task.descriptor_date.descending
source: By date descending
ru: По убыванию даты выполнения

# task.descriptor_created.ascending
source: Created long ago
ru: Сначала созданные недавно

# task.descriptor_created.descending
source: Created recently
ru: Сначала созданные давно

# task.descriptor_comments.ascending
source: Less comment first
ru: Сначала меньше комментариев

# task.descriptor_comments.descending
source: More comments first
ru: Сначала больше комментариев

# task.descriptor_priority.ascending
source: Lower priority first
ru: Сначала менее приоритетные

# task.descriptor_priority.descending
source: Higher priority first
ru: Сначала более приоритетные

# filters.screen_reset.title
source: Reset
ru: Сбросить

# filters.screen_title
source: Change ordering
ru: Изменить порядок

# reachability_offline.title
source: Device is offline
ru: Нет сети

# reachability_fetch.projects
source: Projects list can be outdated
ru: Будет отображен неактуальный список проектов

# reachability_add.project
source: Try create project later
ru: Повторите попытку создать проект позже

# reachability_edit.project
source: Try edit project later
ru: Повторите попытку редактировать проект позже

# reachability_delete.project
source: Try delete project later
ru: Повторите попытку удалить проект позже

# reachability_add.task
source: Try add task later
ru: Повторите попытку создать задачу позже

# reachability_fetch.tasks
source: Tasks list can be outdated
ru: Будет отображен неактуальный список задач

# reachability_edit.task
source: Try edit task later
ru: Повторите попытку редактировать задачу позже

# reachability_close.task
source: Try close task later
ru: Повторите попытку закрыть задачу позже

# reachability_delete.task
source: Try delete task later
ru: Повторите попытку удалить задачу позже

# reachability_add.logOut
source: Try log out later
ru: Повторите попытку выйти из аккаунта позже

# tableview_no.tasks.title
source: You don't have any tasks here
ru: Здесь нет ни одной задачи

# tableview_no.tasks.message
source: Add one by clicking '+' button below
ru: Вы можете создать задачу, нажав кнопку '+' ниже

# tableview_no.projects.title
source: You don't have any projects here
ru: Здесь нет ни одного проекта

# tableview_no.projects.message
source: Add one by clicking '+' button below
ru: Вы можете создать проект, нажав кнопку '+' ниже

# no.network.view_title
source: No internet connection. Can't sync data
ru: Нет сети. Невозможно обновить данные

# search.bar_project
source: Search project
ru: Найти проект

# search.bar_task
source: Search task
ru: Найти задачу

# auth.error_empty.token
source: Can't get authorization token from server. Try later
ru: Невозможно получить токен авторизации. Попробуйте позже

# auth.error_not.valid.url
source: Invalid authorization redirect. Try again
ru: Ошибка ссылки авторизации. Попробуйте позже

# auth.error_invalid.grands
source: Invalid grands
ru: Ошибка

# watch.session_encoding.failed
source: Converting data to update info on your watch failed. Info on watch device will stay outdated
ru: Произошла ошибка при подготовке данных для Ваших watch. Данные на watch устройстве останутся без изменений

# watch.session_decoding.failed
source: Converting data to update info on your watch failed. Info on watch device will stay outdated
ru: Произошла ошибка при подготовке данных для Ваших watch. Данные на watch устройстве останутся без изменений

# watch.session_context.updating.failed
source: Sync with your watch failed. Info on watch device will stay outdated
ru: Не удалось синхронизировать данные с Вашими watch. Данные на watch устройстве останутся без изменений

# split.menu_all.projects
source: Projects
ru: Проекты

# split.menu_all.tasks
source: Tasks
ru: Задачи

# split.menu_settings
source: Settings
ru: Настройки
